from flask import Flask, render_template, Markup

class CustomFlask(Flask):
    jinja_options = Flask.jinja_options.copy()
    jinja_options.update(dict(
        variable_start_string='@@',
        variable_end_string='@@',
    ))


app = CustomFlask(__name__)

stories = {
    "o1" : """
        Йшов 2025 рік ...

        Вчені з різних країн зробили прорив в різних сферах діяльності, вони намагалися зробити
    все під блага людства. Ми досягли вершин. Світ був якоюйсь утопією. Раніше люди могли
    тільки мріяти про такий прогрес. Надалі багато чого переходило на новий рівень
    існування ... Ми поступово переходимо в цифровий світ.
    
        Рік 2030 ...
    
        Багатьох вчених мучило одне питання: "Як перевести себе в цифровий вигляд?".
    Через кілька років, одній людині вдалося це зробити. Це був Джордан Смітт.
    Він був переший кому вдалося перенести свідомість в цифрову реальність. Після цього відкриття Джордан
    опублікував статтю про своє досягнення. Через три місяці його вбили, а його досягнення звинуватили
    в підробці і видалили всю інформацію про проект "Cyber ​​self"... Після цього випадку весь світ зійшов з розуму.
    Скрізь почалися конфлікти в "двох реальностях". Багатьом шанувальникам Смітта дали
    терміни у в'язниці. Якість життя почала падати.
    
        Здавалося що проект був загублений. Але це не так, якщо заглянути в глибини Інтерту,
    можна знайти багато файлів про "Cyber ​​self". Багато інтузіастів почали збирати даний прилад з
    "Уривків інформації". Не багатьом вдавалося повторити успіх ... Противникам Смітта це не сподобалося,
    тоді почалася нова хвиля затримань, злодійства і кібер-злочинів. А також в деяких
    областях планети був випущений вірус "D-231". Багато людей загинуло.
    
        Одного разу, весь світ побачив повідомлення про якийсь "новий світ", світ без влади і цензури.
    Це був кібер-світ. Доступ в "Cyber ​​world", здійснювався завдяки технології Джордана Смітта.
    Але що б знайти тих людей, хто зміг би доправити в "Cyber ​​world" потрібно було шукати в "Darknet".
    "Cyber ​​world" представляв з себе нову мережу, всередині мережі "Darknet". Куди могла потрапити тільки
    свідомість людини. Людина могла перенести себе в кібер-світ назавжди, тобто його тіло вмирало. Або
    ж просто купити міні версію приладу Смітта, в той час коли людина не в "Нашій реальності"
    його тіло відпочиває.

        Першими користувачами "Cyber ​​world" були різні хакери, інжинери і вся інша техно-еліта.
    Вони там були своїми. Там зароджувалися групи які боролися з властю. Таким чином
    людство давало відсіч. Або ж "Cyber ​​world" ставав домівкою для співтовариств різного характеру.
    
        Але одного разу в "Cyber ​​world" з'явилася група "Techno image", яка пропагувала
    заступитися за владу. І після цього моменту все змінилось.
    """
}


@app.route("/")
def index():
    return render_template(
        "index.html",
        data = {
            "welcome" : "Welcome to underground",
            "stories" : stories
        }
    )


@app.template_filter('clear')
def clear_(s):
    return s.replace("|", "")


if __name__ == "__main__":
    app.run(debug = True)